<!DOCTYPE html>
<html>
<head>
    <title>Creaci&oacute;n de blog</title>
    <link rel="stylesheet" href="css/style.css">
</head>
<body>
    <header class="header">
        <h2>Est&aacute;ndares HTML</h2>
        <nav class="header-right">
            <ul>
                <li><a class="active" href="#html">HTML</a></li>
                <li><a href="css.html">CSS</a></li>
                <li><a href="javascript.html">Javascript</a></li>
            </ul>
        </nav>
    </header>
    <main class="main">
        <section>
            <h2>Est&aacute;ndares HTML, &iquest;qu&eacute; son y por qu&eacute; usarlos?</h2>
            <p>HTML es un lenguaje de marcado con el que se crea la estructura y el contenido de las p&aacute;ginas web. Si pulsas "Ver c&oacute;digo fuente" en tu navegador, ver&aacute;s las etiquetas HTML de la p&aacute;gina web: son los elementos rodeados por <>. Estas etiquetas le indican al navegador qu&eacute; clase de elemento es el que viene a continuaci&oacute;n: un p&aacute;rrafo, un encabezado, una tabla, un listado, ...</p>
            <article>
                <h3>Est&aacute;ndares HTML</h3>
                <p>Existen multiples est&aacute;ndares HTML (HTML 4.01, XHTML 1.0, HTML 5, ...). Al principio del documento debe indic&aacute;rsele al navegador qu&eacute; versi&oacute;n se va a utilizar, ya que cada una de ellas tiene unas reglas distintas para interpretar las etiquetas.

                Si no se le indica al navegador el est&aacute;ndar que se est&aacute; usando o si se le indica uno pero no se siguen correctamente las normas del mismo, el navegador intenta interpretar lo que se quer&iacute;a hacer. El problema de esto es que cada navegador trata de interpretarlo a su manera y puede llegar a conclusiones distintas. Por eso se deben usar los est&aacute;ndares: si sigues el est&aacute;ndar todos los navegadores saben lo que quieres hacer, no tienen que procurar adivinarlo.</p>
            </article>
            <article>
                <h3>HTML sem&aacute;ntico</h3>
                <p>Las etiquetas HTML no le dicen al navegador la apariencia que deben tener los elementos dentro de la p&aacute;gina web, solamente se&ntilde;alan cu&aacute;l es su funci&oacute;n. La mayor&iacute;a de los navegadores muestran los elementos de una forma similar; por ejemplo, un encabezado h1 se mostrar&aacute; en letra grande y en negrita en casi todos los navegadores.

                Hacer HTML sem&aacute;ntico significa marcar cada elemento seg&uacute;n su funci&oacute;n dentro del documento (valor sem&aacute;ntico). Por ejemplo, no marcar un texto como si fuese un encabezado s&oacute;lo para que coja esa apariencia, ni dejar de marcar un encabezado como tal para darle una apariencia distinta. La apariencia de los elementos debe cambiarse con CSS, para mantener separada la estructura (HTML) de la apariencia (CSS).
                El HTML sem&aacute;ntico favorece la accesibilidad y la usabilidad. Por ejemplo, algunas herramientas (como JAWS) y navegadores (como Opera) pueden cojer todos los encabezados de la p&aacute;gina web y hacer un &iacute;ndice con ellos, permitiendo saltar de un encabezado a otro. Evidentemente, para que esto funcione, los t&iacute;tulos tienen que estar marcados como tales (h1, h2, ...).

                Por esta raz&oacute;n es muy importante el correcto uso del HTML y no utilizarlo para fines est&eacute;ticos o de posicionamiento.</p>
            </article>
        </section>
        <aside>
            <h2>&iquest;Quieres aprender a programar?</h2>
            <img src="images/programar.jpg">
            <p>Dentro del plantel de especialidades que puedes escoger hoy en d&iacute;a, la del desarrollador web es una de las m&aacute;s demandadas. Decidir que vas a hacer con tu vida en edades tempranas es una elecci&oacute;n dura. Por un lado tienes que pensar en las distintas salidas que tendr&aacute; lo que elijas y por otro lado te tiene que gustar. Por experiencia, no hay nada m&aacute;s terrible que dedicarte de pleno a un trabajo que no te satisface. Esto provoca desilusiones constantes, p&eacute;rdidas de actitud y fracasos continuos como trabajador. Siempre hay que elegir una vocaci&oacute;n que te guste, sino al cabo de los a&ntilde;os te arrepentir&aacute;s de haberlo hecho, aunque sea un trabajo con muchas opciones laborales.</p>
        </aside>
    </main>
    <footer class="footer">
        <p>Creado por Jonathan Alonso Pinto - 2022</p>
    </footer>
</body>
</html>

