<!DOCTYPE html>
<html>
<head>
    <title>Creaci&oacute;n de blog</title>
    <link rel="stylesheet" href="css/style.css">
</head>
<body>
    <header class="header">
        <h2>Est&aacute;ndares Javascript</h2>
        <nav class="header-right">
            <ul>
                <li><a href="index.html">HTML</a></li>
                <li><a href="css.html">CSS</a></li>
                <li><a class="active" href="#javascript">Javascript</a></li>
            </ul>
        </nav>
    </header>
    <main class="main">
        <section>
            <h2>Javascript, &iquest;qu&eacute; es?</h2>
            <p>Javascript es un lenguaje de programaci&oacute;n que se ejecuta en el navegador y que se utiliza para mejorar la interacci&oacute;n con las p&aacute;ginas web.</p>
            <article>
                <h3>Est&aacute;ndares Javascript</h3>
                <p>El HTML es est&aacute;tico: una vez cargada la p&aacute;gina web, la &uacute;nica forma de interactuar con ella es por medio de formularios y/o recarg&aacute;ndola. Con Javascript se pueden hacer programas que respondan a acciones del usuario: mostrar mensajes, arrastrar elementos, crear efectos, modificar contenidos, ...

                El est&aacute;ndar que se usa para la programaci&oacute;n con Javascript es el DOM de la W3C, que es una API para acceder, a&ntilde;adir y cambiar din&aacute;micamente contenidos en documentos HTML.</p>
            </article>
            <article>
                <h3>Javascript no obstructivo</h3>
                <p>El Javascript puede ir incrustado directamente en el HTML. Javascript no obstructivo se refiere a la correcta separaci&oacute;n entre capas: separar el HTML (estructura) y CSS (apariencia) del Javascript (comportamiento); y a que la p&aacute;gina web pueda ser usada por los usuarios sin Javascript.

                Para poder hacer p&aacute;ginas web accesibles, es indispensable que todo el Javascript que tengan est&eacute; programado de forma no obstructiva, ya que muchos usuarios utilizan aparatos que no tienen Javascript. Tambi&eacute;n favorece el posicionamiento web, ya que los robots de los buscadores (Google, Yahoo, ...) no saben ejecutar Javascript.</p>
            </article>
        </section>
        <aside>
            <h2>&iquest;Quieres aprender a programar?</h2>
            <img src="images/programar.jpg">
            <p>Dentro del plantel de especialidades que puedes escoger hoy en d&iacute;a, la del desarrollador web es una de las m&aacute;s demandadas. Decidir que vas a hacer con tu vida en edades tempranas es una elecci&oacute;n dura. Por un lado tienes que pensar en las distintas salidas que tendr&aacute; lo que elijas y por otro lado te tiene que gustar. Por experiencia, no hay nada m&aacute;s terrible que dedicarte de pleno a un trabajo que no te satisface. Esto provoca desilusiones constantes, p&eacute;rdidas de actitud y fracasos continuos como trabajador. Siempre hay que elegir una vocaci&oacute;n que te guste, sino al cabo de los a&ntilde;os te arrepentir&aacute;s de haberlo hecho, aunque sea un trabajo con muchas opciones laborales.</p>
        </aside>
    </main>
    <footer class="footer">
        <p>Creado por Jonathan Alonso Pinto - 2022</p>
    </footer>
</body>
</html>

